<?php
    $this->title = "Мануал";
?>

<h1><a id="_0"></a>Пользователь</h1>
<ul>
    <li>
        <p>На странице Отзывы, можно оставить сообщение о работе сайта, и поставить оценку.<br>
            Администратор может редактировать оставленные сообщения и установить статус <code>Отображаемый</code>,<br>
            чтобы показывать эти сообщения на странице Отзывы.</p>
    </li>
    <li>
        <p>Пользователь может отмечать товары избранными.<br>
            Для каждого товара в качестве рейтинга отображается кол-во пользователей, отметевших этот товар.<br>
            Избранные товары доступны во вкладке “Избранное” в личном кабинете пользователя.</p>
    </li>
</ul>
<h3><a id="_8"></a>Регистрация</h3>
<p>Зарегистрироваться можно двумя способами:</p>
<ul>
    <li>Стандартный способ: заполните форму с эл. ящиком и паролем. На эл. почту будет отправлена ссылка для активации.</li>
    <li>Авторизация через соц сети: нажав одну из 4 кнопок соц сетей, вы можете авторизоваться на нашем сайте, не вводя пароль.<br>
        К вашему аккаунту будет привязана эл. почта, которую была сохранена в выбранной соц сети. Если с данной почтой уже был создан аккаунт, вы войдёте под ним.</li>
</ul>
<p>Вы можете добавить номер телефона в настройках профиля, для того чтобы получать смс извещения (мы хотели использовать смску с кодом активации для того чтобы убедиться в подлинности телефона, будем так делать?).</p>
<p>На случай утери пароля, можно воспользоваться отправкой ссылки для сброса пароля на привязанный email.</p>
<h3><a id="__17"></a>Личный кабинет</h3>
<ul>
    <li>История покупок - в таблице отображены все заказы клиента:
        <ul>
            <li>
                <p>сумма заказа - цена всех заказанных товаров</p>
            </li>
            <li>
                <p>сумма к оплате - цена всех товаров, которые подтвердил поставщик (только для заказов прошедших подтверждение поставщика)</p>
            </li>
            <li>
                <p>статус одно из:</p>
                <pre><code>  'Проверяется наличие',
  'Проверяется наличие (Отправлен поставщику)',
  'Подтверждён',
  'Частично подтверждён',
  'Полностью не подтверждён',
  'Оплачен',
  'Оплачен (Отправлен поставщику)',
  'Готов к выдаче',
  'Выполнен',
  'Оплата просрочена',
  'Отменён',
  'Не забран с пункта выдачи',
</code></pre>
            </li>
            <li>
                <p>Номер заказа состоит из двух частей: ид пользователя, порядковый номер данного заказа. Это поле также является ссылкой, нажав на которую вы перейдете на страницу этого заказа.</p>
            </li>
        </ul>
    </li>
    <li>Сообщения - пользователю приходят сообщения в личный кабинет, при успешном оформлении заказа, при изменении их статусов и тд.</li>
    <li>Избранное - товары отмеченные звёздочкой в каталоге.</li>
    <li>В настройках профиля можно изменить пароль или номер телефона.</li>
</ul>
<h3><a id="_41"></a>Покупки</h3>
<ul>
    <li>
        <p>Пользователь может добавлять товары в корзину, даже если он не авторизирован. При нажатии на кнопку оформления заказа его попросят авторизироваться, после чего заказ будет оформлен.</p>
    </li>
    <li>
        <p>Страницу заказа можно открыть, нажав на ссылку в истории покупок личного кабинета. На странице отображается подробная информация о заказе, в тч. состав.</p>
    </li>
    <li>
        <p>В 23:50 все заказы сделанные в этот день меняют статус с <code>Проверяется наличие</code> на <code>Проверяется наличие (Отправлен поставщику)</code></p>
    </li>
    <li>
        <p>По мере поступления ответов поставщиков, в заказе отмечается кол-во подтверждённых товаров.<br>
            Когда последний необходимый ответ будет загружен:</p>
        <ul>
            <li>придёт извещение в личный кабинет и эл. ящик с ссылкой на страницу заказа</li>
            <li>статус изменится на одно из:<br>
                <code>Подтверждён</code>,<br>
                <code>Частично подтверждён</code>,<br>
                <code>Полностью не подтверждён</code>,</li>
            <li>появится сумма к оплате,</li>
            <li>появится возможность оплатить заказа, кроме заказов со статусом <code>Полностью не подтверждён</code></li>
        </ul>
    </li>
    <li>
        <p>Заказы могут быть отменены, если находятся в одном из состояний</p>
        <pre><code>  'Проверяется наличие',
  'Проверяется наличие (Отправлен поставщику)',
  'Подтверждён',
  'Частично подтверждён',
</code></pre>
    </li>
    <li>
        <p>После оплаты статус изменится на <code>Оплачен</code>.</p>
    </li>
    <li>
        <p>В 23:50 все оплаченные заказы получат статус <code>Оплачен (Отправлен поставщику)</code>, неоплаченные - <code>Оплата просрочена</code></p>
    </li>
    <li>
        <p>Когда менеджер подготовит заказ и изменит его статус на <code>Готов к выдаче</code> в личный кабинет,<br>
            на эл. ящик и телефон (если он указан) придут извещения, со сгенерированным секретным ключом.</p>
    </li>
</ul>
<h1><a id="_65"></a>Менеджер</h1>
<ul>
    <li>Пользователь с правами менеджера (назначаются из Зазеркалья) могут могут просматривать Панель менеджера.<br>
        В ней отображается форма ввода секретного ключа и таблица со всеми заказами<br>
        (возможно стоит отображать только заказы с определёнными статусами, подумайте какими).</li>
    <li>Менеджер может перейти на страницу заказа.</li>
    <li>Секретный пароль и кнопки оплатить/отменить заказ для него не отображаются.</li>
    <li>Заказы со статусом <code>Оплачен (Отправлен поставщику)</code> могут быть изменены на <code>Готов к выдаче</code>.</li>
    <li>На главной странице можно ввести секретный ключ, если он совпадёт с ключом какого-нибудь заказа,<br>
        то этот заказ изменит статус на <code>Выполнен</code>, и менеджер перейдёт на страницу этого заказа.</li>
</ul>
<h1><a id="_75"></a>Администратор</h1>
<p>Пользователи с правами администратора имеют доступ в Зазеркалье (Панель администратора).
    На страницах с товарами, категориями и заказами пользовательского интерфейса имеются ссылки (<code>Просмотреть в панели администратора</code>)
    на соответствующие страницы панели администратора. Используйте это для поиска конкретных товаров/категорий/заказов,
    т.к. в панели администратора нет отдельных модулей поиска.<br>
    Панель администратора состоит из 7 вкладок:</p>
<h3><a></a>Мануал</h3>
<p>Эту страницу вы читаете прямо сейчас.</p>

<h3><a id="_78"></a>Загрузки</h3>
<p>Первый загрузчик файлов “Обновить базу данных из архива” позволяет отправить zip-архив с xml файлами для обновления БД товаров.<br>
    Архив должен иметь следующую структуру (ВСЕ папки обязательны)</p>
<pre><code>webdata\
    000000001\
        XML файл начинающийся с import___
        goods\
            Произвольное кол-во папок\
                XML файл начинающийся с import___
                XML файл начинающийся с prices___
        properties\
            1\
                XML файл начинающийся с import___
</code></pre>
<p>После загрузки файла на страницу будут выведены все сообщения об ошибках. Например:</p>
<ul>
    <li><code>Не указана цена товара с ГУИД d9575c94-17c6-11e7-bea4-742f68ca67ee</code>.<br>
        Товару будет установлен статус “Ошибка” и он не будет отображаться на сайте.</li>
    <li><code>Неизвестная категория товаров с ГУИД d9575c94-17c6-11e7-bea4-742f68ca67ee</code>.<br>
        Товар не будет добавлен в базу.</li>
    <li><code>Неизвестное свойство товара с ГУИД d9575c94-17c6-11e7-bea4-742f68ca67ee</code>.<br>
        Свойство не будет добавлено к товару.</li>
</ul>
<p>Кроме ошибок также будет показано сколько было произведено успешных операций добавления/изменения товаров/категорий.</p>
<p>Кнопка “Скачать - Выгрузить зявки поставщикам” позволяет скачать zip архив, с заявками для поставщиков.<br>
    Этот архив формируется каждые сутки в 23:50.</p>
<ul>
    <li>Для каждого поставщика, к которому были предзаказы, будет сформирован бланк ПРЕДЗАКАЗА со списком товаров,<br>
        которые были заказаны в это день. Количество товара будет просуммировано по всем заявкам.<br>
        Файл будет иметь имя <code>Номер_предзаказа-preorder.xlsx</code></li>
    <li>Для всех предзаказов, заказы из которых были оплачены, будет сформирован бланк ЗАКАЗА  со списком товаров,<br>
        которые были оплачены в этот день. Количество товара будет равно количеству, оплаченного клиентами, товара.<br>
        Бланку заказа присваивается тот же номер что и соответствующему бланку предзаказа.<br>
        Файл будет иметь имя <code>Номер_заказа-order.xlsx</code><br>
        Все файлы будут рапределены по папкам, по одной для каждого поставщика.</li>
</ul>
<p>Загрузчик файлов “Загрузить ответы поставщиков.” позволяет загрузить на сайт ответы поставщиков.<br>
    Формат ответа поставщика в точности соответствует формату файлов с заказами/предзаказами.<br>
    Например, отправленный в качестве ответа файл preorder.xlsx будет обозначать наличие у постащика всех позиций, запрошенных в предзаказе.<br>
    Оформлять ответ нужно как можно более точно, не следует надеяться что сайт будет догадываться о том где и как расположены данные в таблице.<br>
    Идеальным вариантом является редактирование файла preorder.xlsx: изменение столбца “количество” для товаров которых не хватило, (в том числе на 0, если товара нет совсем).<br>
    После обработки файла вы получите краткий отчёт:</p>
<ul>
    <li>количество заказов, изменивших статус</li>
    <li>количество обработанных товаров</li>
    <li>1C ИД лишних товаров</li>
</ul>
<p>Заявки для которых не будут загружены ответы поставщиков,<br>
    будут сохранять статус <code>Проверяется наличие (Отправлен поставщику)</code>.<br>
    Их нельзя будет оплатить.<br>
    Поэтому если ответ поставщика по каким-то<br>
    причинам не удалось получить, следует загрузить файл ответа с пустым списком товаров,<br>
    заполнив при этом шапку таблицы (в т.ч. номер бланка предзаказа).</p>

<h3><a id="_132"></a>Пользователи</h3>
<p>Таблица всех пользователей зарегистрированных на сайте.</p>
<ul>
    <li>Статус - пользователи, которые еще не подтвердили свой email имею статус <code>не активирован</code> и не могут совершать покупки.</li>
    <li>Роль - имеется 3 роли:
        <ul>
            <li>admin</li>
            <li>manager</li>
            <li>user</li>
        </ul>
    </li>
</ul>
<p>Администратор также обладает правами менеджера и пользователя, а менеджер правами пользователя.<br>
    Для редактирования записи следует кликнуть по иконке с карандашом в последней колонке табл.</p>
<h3><a id="__142"></a>Категории товаров</h3>
<p>Изначально вы видите список всех корневых категорий.<br>
    Кликнув по каждой категории вы можете увидеть список всех вложенных в неё категорий.<br>
    Вы можете удалять подразделы. Удаление подраздела также удалит все вложенные в него.<br>
    Чтобы добавить новый подраздел просто введите новое имя и кликните кнопку добавить.<br>
    Если вы кликните по категории, у которой нет вложенных категорий, вы увидите список всех товаров из этой категории.</p>
<h3><a id="_148"></a>Товары</h3>
<p>Полный список всех товаров. Отображает полный список товаров. В т.ч. те статус которых не равен "ОК".
Товары с такими статусами не отображаются
в основном интерфейсе сайта, а значит отредактировать и изменить их статус на "ОК", вы сможете только найдя их в этой таблице.
Используйте сортировку по статусам, для поиска товаров, которые в данный момент не готовы к продаже.
Будьте осторожны с удалением. Это замечание касается не только товаров, но и всех других сущностей.
Удаление товаров/категорий/заказов приведёт к удалению не только самомих этих сущностей, но и зависимых от них,
таких как закладки/товары в категории и т.д. Измените статус на <code>Скрытый/Отменён</code>, если не уверены в действии.</p>
<h3><a id="_150"></a>Заказы</h3>
<p>Список заказов.<br>
    Кнопка “Добавить случайный заказ” добавляет заказ со случайным списком товаров (отображается только в режиме отладки).</p>
<p>Нажав на кнопку редактирования заказа, вы можете просмотреть и отредактировать перечень товаров в этом заказе.</p>
<p>Статус заявки <code>'Оплачен'</code>
    может быть выставлены только в случае, если она была действительна оплачена и для неё был сохранён номер оплаты в системе банка. <br>
    Статусы заявок <code>'Оплачен (Отправлен поставщику)', 'Готов к выдаче'</code>
    могут быть выставлены только если до этого имели статусы
    <code>'Оплачен', 'Оплачен(Отправлен поставщику)'</code>.<br>
    Это сделано из соображений безопастности, поскольку эти статусы обозначают обязаность магазина выдать заказ клиенту.
</p>
<h3><a id="_155"></a>Отзывы</h3>
<p>Статус отзыва принимает одно из трёх значений</p>
<ul>
    <li><code>скрытый</code> и <code>непроверенный</code>- не отображаются во вкладке Отзывы.<br>
        Используйте статус <code>скрытый</code>, чтобы пометить проверенные отзывы, которые вы не хотите показывать посетителям.</li>
    <li><code>отображаемый</code> - отображается.</li>
</ul>

</body></html>
