<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'О компании';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="page-static site-about">
    <h1><?= Html::encode($this->title) ?></h1>

    <h2>РЕКВИЗИТЫ ПРОДАВЦА</h2>
    <p>Продавец: ООО «КУПИ»</p>
    <p>Телефон: <a href="tel:+74232756699">8 (423) 275-66-99</a></p>
    <p>Адрес: г. Владивосток, ул Толбухина 2 офис2</p>
    <p>Юридический адрес г. Владивосток, ул Толбухина 2 офис2</p>
    <p>ИНН/КПП: 2543115199/254301001</p>
    <p>ОГРН: 1172536027432</p>
    <p>Банковские реквизиты:</p>
    <p>Наименование Банка: Дальневосточный банк ПАО Сбербанк г. Хабаровск</p>
    <p>К/с 30101810600000000608</p>
    <p>Бик: 040813608</p>
    <p>Р/с 40702810950000020239</p>
    <br/>
</div>
