<?php
$this->params['catalog'] = true;
$this->title = "Оплата";
$this->params['breadcrumbs'][] = $this->title;
?>
<h1><?=$this->title?></h1>
<div class="page-static payment">
    <h3>Банковские карты</h3>
    Вы можете оплатить ваши покупки с помощью банковской карты.<br>
    Оплата происходит через ПАО СБЕРБАНК с использованием Банковских карт следующих платежных систем:
    <br><br>
    МИР <img src='/img/logo-mir.jpg' width=40><br><br>
    VISA International <img src='/img/Visa.jpg' width=40><br><br>
    Mastercard Worldwide <img src='/img/Master Card.jpg' width=40><br><br>

    Когда заказ будет готов к оплате, мы отправим Вам письмо с извещением на Ваш Email
    <h4><b>Описание процесса передачи данных</b></h4>

    Для оплаты (ввода реквизитов Вашей карты) Вы будете перенаправлены на платежный шлюз ПАО СБЕРБАНК.
    Соединение с платежным шлюзом и передача информации осуществляется в защищенном режиме с
    использованием протокола шифрования SSL. В случае если Ваш банк поддерживает технологию безопасного
    проведения интернет-платежей Verified By Visa или MasterCard SecureCode для проведения платежа также
    может потребоваться ввод специального пароля. Настоящий сайт поддерживает 256-битное шифрование.
    Конфиденциальность сообщаемой персональной информации обеспечивается ПАО СБЕРБАНК.
    Введенная информация не будет предоставлена третьим лицам за исключением случаев, предусмотренных
    законодательством РФ. Проведение платежей по банковским картам осуществляется в строгом соответствии с
    требованиями платежных систем МИР, Visa Int. и MasterCard Europe Sprl
</div>

