<?php
use app\components\Html;

$this->title = 'Возврат товара' .
    '';
$this->params['breadcrumbs'][] = $this->title;
?>
<style>
    #nav-aside {
        padding-top: 25px;
    }
    #nav-aside a {
        color: #767685;
        border-bottom: 1px dotted;
        text-decoration: none;
    }
    #nav-aside a:hover {
        border-bottom-style: solid;
    }
    #nav-aside a.child {
        padding-left: 15px;
    }
    .p-rules ol { counter-reset: item; padding-left: 20px; }
    .p-rules ol > li{ display: block }
    .p-rules ol > li:before { content: counters(item, ".") ". "; counter-increment: item;}
    .p-rules ol > li.ol-title:before { font-size: 20px;}
    .p-rules li > ol > li:before {font-size: 14px;}
    .p-rules h3, .p-rules h2.list_title {
        font-size: 20px;
        display: inline;
        font-weight: bold;
    }
    .ol-title li {
        font-size: 14px;
    }
    ol.ol-root {
        padding-left: 0;
    }
</style>
<div class="page-static p-rules">
    <h1><?= Html::encode($this->title) ?></h1>
    <div class="row">
        <div class="col-sm-3">
            <div id="nav-aside">

            </div>
        </div>
        <div class="col-sm-8">
            <h2>Возможность отказа от не оплаченных товаров</h2>
            <p>
                При получении заказа вы всегда можете отказаться от всех или части товаров, которые вас по каким-то причинам не устроили, не оплачивая их стоимость.
            </p>
            <p>
                Если для оплаты вы использовали банковскую карту, то у вас также есть возможность отказа от всех или части доставленных товаров: в товарном чеке делается отметка о возврате товаров, а с карты производится платёж на сумму, соответствующую фактической стоимости полученных товаров.
            </p>
            <p>
                Возврат товаров после оплаты осуществляется на общих основаниях и регламентируется Законодательством РФ.
            </p>

            <h2>Возврат продовольственных товаров</h2>
            <p>
                К возврату принимаются продовольственные товары только ненадлежащего качества, то есть непригодные для использования по назначению, брак, товары с недостатком (недостаток – это нарушение обязательных требований к товару) или не соответствующие описанию на сайте, с истекшим сроком годности.
            </p>
            <p>
                Продовольственные товары надлежащего качества возврату или обмену не подлежат!
            </p>
            <h2>Возврат непродовольственных товаров ненадлежащего качества</h2>

            <p>
                При обнаружении в купленных товарах дефектов, покупатель может произвести возврат приобретённых непродовольственных товаров ненадлежащего качества, согласно Законодательству Российской Федерации.
            </p><p>
                Обращаем также ваше внимание на то, что при получении и оплате заказа покупатель в присутствии курьера, либо в присутствии работника точки выдачи (при личном визите) обязан проверить комплектацию и внешний вид изделия на предмет отсутствия физических дефектов (царапин, трещин, сколов и т.п.) и полноту комплектации. После отъезда курьера, или после ухода из помещения точки выдачи, претензии по этим вопросам не принимаются.
            </p><p>
                3Требования потребителя о возврате уплаченной за товар денежной суммы подлежат удовлетворению в течение десяти дней со дня предъявления соответствующего требования.

            <h2>Возврат непродовольственных товаров надлежащего качества</h2>
            <p>
                Потребитель вправе вернуть непродовольственный товар надлежащего качества, если указанный товар не подошел по форме, габаритам, фасону, расцветке, размеру или комплектации в течение четырнадцати дней, не считая дня его покупки.
            </p>
            <ul>
                <li>
                    Предметы санитарии и гигиены..., средства гигиены полости рта, предметы по уходу за детьми;
                </li><li>
                    Предметы личной гигиены (зубные щетки, расчески, заколки, бигуди для волос, парики, шиньоны и другие аналогичные товары);
                </li><li>
                    Парфюмерно-косметические товары;
                </li><li>
                    Текстильные товары (хлопчатобумажные, льняные, шелковые, шерстяные и синтетические ткани, товары из нетканых материалов типа тканей - ленты, тесьма, кружево и другие);
                </li><li>
                    Швейные и трикотажные изделия (изделия швейные и трикотажные бельевые, изделия чулочно-носочные);
                </li><li>
                    Изделия и материалы, полностью или частично изготовленные из полимерных материалов и контактирующие с пищевыми продуктами (посуда и принадлежности столовые и кухонные, емкости и упаковочные материалы для хранения и транспортирования пищевых продуктов, в том числе для разового использования)
                </li><li>
                    Товары бытовой химии.</li>
            </ul>
            <p>
                Условия возврата непродовольственного товара надлежащего качества:
            </p>
            <ul>
                <li>
                    указанный товар не был в употреблении,
                </li><li>
                    сохранены его товарный вид, потребительские свойства,
                </li><li>
                    сохранены пломбы, фабричные ярлыки,
                </li><li>
                    а также имеется товарный или кассовый чек.
                </li><li>
                    Требование потребителя о возврате уплаченной за указанный товар денежной суммы подлежит удовлетворению в течение трех дней со дня возврата указанного товара.
                </li>
            </ul>
    </div>
    </div>
</div>

<script>
    (function () {
        HTMLElement.prototype.hasClass = function(cls) {
            var i;
            var classes = this.className.split(" ");
            for(i = 0; i < classes.length; i++) {
                if(classes[i] == cls) {
                    return true;
                }
            }
            return false;
        };

        var nav = document.getElementById('nav-aside'),
            h2 = document.getElementsByTagName('h2'),
            anchor;
        for(var i = 0; i < h2.length; i++) {
            anchor = 'r' + i;
            var a = document.createElement('a');
            a.innerHTML = h2[i].innerText;
            a.setAttribute('href', '#' + anchor);
            h2[i].setAttribute('id', anchor);

            nav.appendChild(a);
            nav.appendChild(document.createElement('br'));
            nav.appendChild(document.createElement('br'));
        }

    })();
</script>