<?php
use app\components\Html;

$this->title = 'Пользовательское соглашение';
$this->params['breadcrumbs'][] = $this->title;
?>
<style>
    #nav-aside {
        padding-top: 25px;
    }
    #nav-aside a {
        color: #767685;
        border-bottom: 1px dotted;
        text-decoration: none;
    }
    #nav-aside a:hover {
        border-bottom-style: solid;
    }
    #nav-aside a.child {
        padding-left: 15px;
    }
    .p-rules ol { counter-reset: item; padding-left: 20px; }
    .p-rules ol > li{ display: block }
    .p-rules ol > li:before { content: counters(item, ".") ". "; counter-increment: item;}
    .p-rules ol > li.ol-title:before { font-size: 20px;}
    .p-rules li > ol > li:before {font-size: 14px;}
    .p-rules h3, .p-rules h2.list_title {
        font-size: 20px;
        display: inline;
        font-weight: bold;
    }
    .ol-title li {
        font-size: 14px;
    }
    ol.ol-root {
        padding-left: 0;
    }
</style>
<div class="page-static p-rules">
    <h1><?= Html::encode($this->title) ?></h1>
    <div class="row">
        <div class="col-sm-2">
            <div id="nav-aside">

            </div>
        </div>
        <div class="col-sm-9">
            <p>
                Интернет-магазин «КуПи», расположенный на доменном имени www.qpvl.ru, организационно-правовая форма:
                Общество с ограниченной ответственностью «КУПИ»
                и юридическим адресом г. Владивосток ул. Толбухина 2, офис2,
                в лице директора Будько Максима Ильича,
                действующего на основании устава,
                именуемое в дальнейшем «Продавец», публикует Публичную оферту о продаже Товара дистанционным способом.
            </p>
            <h2>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h2>
            <p>
                1.1. Публичная оферта (далее – «Оферта») - публичное предложение Продавца, адресованное неопределенному
                кругу лиц, заключить с Продавцом договор купли-продажи товара дистанционным способом
                (далее - «Договор») на условиях, содержащихся в настоящей Оферте, включая все Приложения.
            </p>
            <p>
                1.2. Заказ Товара на сайте Интернет-магазина – позиции указанные Покупателем из ассортимента Товара,
                предложенного к продаже, при оформлении заявки на приобретение Товара на сайте Интернет-магазина или через Оператора.
            </p>

            <h2>2. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
            <p>2.1. Заказ Покупателем Товара, размещенного на сайте Интернет-магазина означает, что Покупатель согласен
                со всеми условиями настоящей Оферты.</p><p>2.2. Администрация сайта Интернет-магазина имеет право вносить
                изменения в Оферту без уведомления Покупателя.

            </p><p>2.3. Срок действия Оферты не ограничен, если иное не указано на сайте Интернет-магазина.

            </p><p>2.4. Продавец предоставляет Покупателю полную и достоверную информацию о Товаре, включая
                информацию об основных потребительских свойствах Товара, месте изготовления, а также информацию
                о гарантийном сроке и сроке годности Товара на сайте Интернет магазина, в разделе название раздела.
            </p>

            <h2>3. ЦЕНА ТОВАРА</h2>

            <p>
                3.1. Цена на каждую позицию Товара указана на сайте Интернет-магазина.
            </p><p>
                3.2. Продавец имеет право в одностороннем порядке изменить цену на любую позицию Товара.
            </p><p>
                3.3. В случае изменения цены на заказанный Товар Продавец обязуется в течение количество дней проинформировать Покупателя об изменении цены Товара.
            </p><p>
                3.4. Покупатель вправе подтвердить либо аннулировать Заказ на приобретение Товара, если цена изменена Продавцом после оформления Заказа.
            </p><p>
                3.5. Изменение Продавцом цены на оплаченный Покупателем Товар не допускается.
            </p><p>
                3.6. Продавец указывает стоимость доставки Товара на сайте Интернет-магазина либо сообщает Покупателю при оформлении заказа Оператором.
            </p><p>
                3.7. Обязательства Покупателя по оплате Товара считаются исполненными с момента поступления Продавцом денежных средств.
            </p><p>
                3.8. Расчеты между Продавцом и Покупателем за Товар производятся способами, указанными на сайте Интернет-магазина в разделе название раздела
            </p>

            <h2>4. ОФОРМЛЕНИЕ ЗАКАЗА</h2>
            <p>4.1. Заказ Товара осуществляется Покупателем через Оператора по телефону номер телефона или через сервис сайта Интернет-магазина www.qpvl.ru
            </p>
            <p>4.2. При регистрации на сайте Интернет-магазина Покупатель обязуется предоставить следующую регистрационную информацию:
            </p>
            <p>4.2.1. фамилия, имя, отчество Покупателя или указанного им лица (получателя);
            </p>
            <p>4.2.2.  адрес, по которому следует доставить Товар (если доставка до адреса Покупателя);
            </p>
            <p>4.2.3. адрес электронной почты;
            </p>
            <p>4.2.4. контактный телефон.
            </p>
            <p>4.3. Наименование, количество, ассортимент, артикул, цена выбранного Покупателем Товара указываются в корзине Покупателя на сайте Интернет-магазина.
            </p>
            <p>4.4. Если Продавцу необходима дополнительная информация, он вправе запросить ее у Покупателя. В случае не предоставления необходимой информации Покупателем, Продавец не несет ответственности за выбранный Покупателем Товар.
            </p>
            <p>4.5. При оформлении Заказа через Оператора (п. 4.1. настоящей Оферты) Покупатель обязуется предоставить информацию, указанную в п. 4.2. настоящей Оферты.
            </p>
            <p>4.6. Принятие Покупателем условий настоящей Оферты осуществляется посредством внесения Покупателем соответствующих данных в регистрационную форму на сайте Интернет-магазина или при оформлении Заказа через Оператора. После оформления Заказа через Оператора данные о Покупателе регистрируются в базе данных Продавца. Утвердив Заказ выбранного Товара, Покупатель предоставляет Оператору необходимую информацию в соответствии с порядком, указанном в п. 4.2. настоящей Оферты.
            </p>
            <p>4.7. Продавец не несет ответственности за содержание и достоверность информации, предоставленной Покупателем при оформлении Заказа.
            </p>
            <p>4.8. Покупатель несет ответственность за достоверность предоставленной информации при оформлении Заказа.
            </p>
            <p>4.9. Договор купли-продажи дистанционным способом между Продавцом и Покупателем считается заключенным с момента выдачи Продавцом Покупателю кассового или товарного чека либо иного документа, подтверждающего оплату Товара .
            </p>

            <h2>5. ДОСТАВКА И ПЕРЕДАЧА ТОВАРА ПОКУПАТЕЛЮ</h2>
            <p>5.1. Продавец оказывает Покупателю услуги по доставке Товара одним из способов указанных на сайте Интернет-магазина.
            </p><p>5.2. Если Договор купли-продажи товара дистанционным способом (далее – Договор) заключен с условием о доставке Товара Покупателю, Продавец обязан в установленный Договором срок доставить Товар в место, указанное Покупателем, а если место доставки Товара Покупателем не указано, то по месту его жительства или регистрации.
            </p><p>5.3. Место доставки Товара Покупатель указывает при оформлении Заказа на приобретение Товара.
            </p><p>5.4. Срок доставки Товара Покупателю состоит из срока обработки заказа и срока доставки.
            </p><p>5.5. Доставленный Товар передается Покупателю, а при отсутствии Покупателя - любому лицу, предъявившему квитанцию или иной документ, подтверждающий заключение Договора или оформление доставки Товара.
            </p><p>5.6. В момент передачи Товара в обязательном порядке в письменной форме Покупателю сообщаются сведения, предусмотренные в Приложении № 1 номер к Договору.
            </p><p>5.7. Информация о Товаре доводится до сведения Покупателя в технической документации, прилагаемой к Товару, на этикетках, путем нанесения маркировки или иным способом, принятым для отдельных видов товаров.
            </p><p>5.8. Сведения об обязательном подтверждении соответствия Товара представляются в порядке и способами, которые установлены законодательством Российской Федерации о техническом регулировании, и включают в себя сведения о номере документа, подтверждающего такое соответствие, о сроке его действия и об организации, его выдавшей.
            </p>

            <h2>6. РЕКВИЗИТЫ ПРОДАВЦА</h2>
            <p>Продавец: ООО «КУПИ»</p>
            <p>Телефон:</p>
            <p>Адрес: г. Владивосток, ул Толбухина 2 офис2</p>
            <p>Юридический адрес г. Владивосток, ул Толбухина 2 офис2</p>
            <p>ИНН/КПП: 2543115199/254301001</p>
            <p>ОГРН: 1172536027432</p>
            <p>Банковские реквизиты:</p>
            <p>Наименование Банка: Дальневосточный банк ПАО Сбербанк г. Хабаровск</p>
            <p>К/с 30101810600000000608</p>
            <p>Бик: 040813608</p>
            <p>Р/с 40702810950000020239</p>
            <br/>
            <p>
                Внимательно ознакомьтесь с текстом публичной оферты, и если Вы не согласны с каким-либо пунктом оферты, Вы вправе отказаться от покупки Товаров, предоставляемых Продавцом, и не совершать действий, указанный в п. 2.1. настоящей Оферты.
            </p>
    </div>
    </div>
</div>

<script>
    (function () {
        HTMLElement.prototype.hasClass = function(cls) {
            var i;
            var classes = this.className.split(" ");
            for(i = 0; i < classes.length; i++) {
                if(classes[i] == cls) {
                    return true;
                }
            }
            return false;
        };

        var nav = document.getElementById('nav-aside'),
            h2 = document.getElementsByTagName('h2'),
            anchor;
        for(var i = 0; i < h2.length; i++) {
            anchor = 'r' + i;
            var a = document.createElement('a');
            a.innerHTML = h2[i].innerText;
            a.setAttribute('href', '#' + anchor);
            h2[i].setAttribute('id', anchor);

            nav.appendChild(a);
            nav.appendChild(document.createElement('br'));
            nav.appendChild(document.createElement('br'));
        }

    })();
</script>